Repository: ZaoLangAI/zaolang
Catalog: ios/App/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja

# remixPage.musicDirectHint
source: 描述音乐或音效
en: Describe the music or sound effect
ja: 音楽や効果音を記述

# remixPage.musicDirectHintBodyMusic
source: 可以描述风格、情绪、节奏与主要乐器，例如“轻快的尤克里里小调，适合治愈系日常短剧”。
en: Describe the style, mood, tempo and main instruments, e.g. "a cheerful ukulele tune for a feel-good daily-life short drama".
ja: スタイル、雰囲気、テンポ、主な楽器を記述してください。例：「ほのぼの系ショートドラマに合う、軽快なウクレレの小曲」。

# remixPage.musicDirectHintBodySfx
source: 描述具体的音效场景，例如“开门时木门吱呀的摩擦声，伴随轻微回响”。
en: Describe the specific sound-effect scene, e.g. "a wooden door creaking open, with a faint echo".
ja: 具体的な効果音のシーンを記述してください。例：「木のドアが軋みながら開く音、微かな残響を伴う」。

# remixPage.musicDurationHint
source: 1-22 秒；留空则由模型决定时长。
en: 1-22 seconds; leave blank to let the model decide.
ja: 1〜22秒。空欄の場合はモデルが長さを決定します。

# remixPage.musicDurationInvalid
source: 时长必须为 1-22 之间的整数秒。
en: Duration must be a whole number of seconds between 1 and 22.
ja: 長さは1〜22の整数秒で指定してください。

# remixPage.musicDurationLabel
source: 音效时长（秒，可选）
en: SFX duration (seconds, optional)
ja: 効果音の長さ（秒・任意）

# remixPage.musicInstrumentalHint
source: 关闭后可填写歌词生成演唱版本。
en: Turn off to add lyrics for a sung version.
ja: オフにすると歌詞を入力して歌唱版を生成できます。

# remixPage.musicInstrumentalLabel
source: 纯音乐（不含歌声）
en: Instrumental (no vocals)
ja: インストゥルメンタル（歌声なし）

# remixPage.musicLyricsHint
source: 留空则生成纯音乐；填写后按结构标签生成演唱版本。
en: Leave blank for an instrumental track; fill in to generate a sung version with structure tags.
ja: 空欄ならインストゥルメンタル、入力すると構造タグに沿った歌唱版を生成します。

# remixPage.musicLyricsLabel
source: 歌词（可选）
en: Lyrics (optional)
ja: 歌詞（任意）

# remixPage.musicLyricsPlaceholder
source: [Verse] 第一段歌词…… [Chorus] 副歌歌词……
en: [Verse] First verse lyrics... [Chorus] Chorus lyrics...
ja: [Verse] 1番の歌詞…… [Chorus] コーラスの歌詞……

# remixPage.musicStyleMusic
source: 背景音乐（BGM）
en: Background music (BGM)
ja: BGM（背景音楽）

# remixPage.musicStyleSfx
source: 音效（SFX）
en: Sound effect (SFX)
ja: 効果音（SFX）

# remixPage.needsUnlock
source: 需要先解锁才能进入工作室
en: Unlock this work to open the studio
ja: スタジオを開くには先に解除してください

# remixPage.needsUnlockHint
source: 作者为二创设置了积分价格。解锁一次后可无限二创。
en: The author set a credit price. Pay once, remix anytime.
ja: 作者がクレジット価格を設定しています。一度支払えば何度でもリミックスできます。

# remixPage.notRemixable
source: 这个作品未开放二创
en: This work is not open for remixing
ja: この作品は二次創作が許可されていません

# remixPage.notRemixableHint
source: 作者把它设为仅展示，你仍然可以收藏或从其他作品开始。
en: The author set it to view only. You can still bookmark it or start from another work.
ja: 作者が閲覧のみに設定しています。保存するか、別の作品から始められます。

# remixPage.orientation
source: 画面方向
en: Orientation
ja: 画面の向き

# remixPage.orientationAdaptive
source: 自适应
en: Adaptive
ja: 自動調整

# remixPage.orientationLandscape
source: 横屏
en: Landscape
ja: 横向き

# remixPage.orientationPortrait
source: 竖屏
en: Portrait
ja: 縦向き

# remixPage.paramsDone
source: 完成
en: Done
ja: 完了

# remixPage.presets.axisLighting
source: 光照 / 时段
en: Lighting / time
ja: 光 / 時間帯

# remixPage.presets.axisPeriod
source: 时期
en: Period
ja: 時代

# remixPage.presets.axisState
source: 状态
en: State
ja: 状態

# remixPage.presets.axisWeather
source: 天气
en: Weather
ja: 天候

# remixPage.presets.expression.anger
source: 愤怒
en: Anger
ja: 怒り

# remixPage.presets.expression.breakdown
source: 崩溃大哭
en: Breakdown
ja: 号泣

# remixPage.presets.expression.cold_gaze
source: 霸总凝视
en: Cold gaze
ja: 冷たい視線

# remixPage.presets.expression.fear
source: 恐惧
en: Fear
ja: 恐怖

# remixPage.presets.expression.laugh
source: 大笑
en: Laugh
ja: 大笑い

# remixPage.presets.expression.neutral
source: 平静
en: Neutral

# remixPage.presets.expression.restrained
source: 隐忍
en: Restrained
ja: こらえる

# remixPage.presets.expression.sad
source: 悲伤
en: Sad
ja: 悲しみ

# remixPage.presets.expression.shock
source: 震惊
en: Shock
ja: 驚愕

# remixPage.presets.expression.shy
source: 羞涩
en: Shy
ja: はにかみ

# remixPage.presets.expression.smile
source: 微笑
en: Smile
ja: 微笑み

# remixPage.presets.expression.smirk
source: 冷笑
en: Smirk

# remixPage.presets.expressionsActiveHint
source: 将生成一张包含 {count} 种表情的合集图，默认不加入角色库。
en: Generates one sheet with {count} expressions. Not added to the character library by default.
ja: {count} 種類の表情を含む1枚を生成します。既定ではキャラクターライブラリに追加しません。

# remixPage.presets.expressionsHint
source: 选择表情后，将以该角色的设定图为参考，生成一张多表情宫格图，而不是设定图。
en: Pick expressions to generate one grid of this character's faces from their sheet, instead of a character sheet.
ja: 表情を選ぶと、このキャラクターの設定画を参考に表情グリッドを1枚生成します（設定画ではありません）。

# remixPage.presets.expressionsLabel
source: 表情合集（可多选）
en: Expression sheet (multi-select)
ja: 表情集（複数選択）

# remixPage.presets.groupActiveHint
source: 请在该维度选择 {min}–{max} 个值；按变体数量计费，逐张生成。
en: Pick {min}–{max} values on that dimension. Charged per variant, generated one by one.
ja: その項目で {min}〜{max} 個選んでください。バリエーション数で課金し、1枚ずつ生成します。

# remixPage.presets.groupAxisValues
source: {axis}（多选）
en: {axis} (multi-select)
ja: {axis}（複数選択）

# remixPage.presets.groupHint
source: 选择一个变化维度，在同一任务中逐张生成多张同机位的变体图。
en: Pick one dimension to vary; the job generates one same-camera variant after another.
ja: 変化させる項目を1つ選ぶと、同じカメラのバリエーションを1枚ずつ続けて生成します。

# remixPage.presets.groupLabel
source: 一次生成多个变体
en: Generate several variants
ja: 複数バリエーションを生成

# remixPage.presets.groupOff
source: 关闭
en: Off
ja: オフ

# remixPage.presets.lighting.candle
source: 烛光
en: Candlelight
ja: ろうそく

# remixPage.presets.lighting.dawn
source: 清晨
en: Dawn
ja: 早朝

# remixPage.presets.lighting.day
source: 白天
en: Day
ja: 昼

# remixPage.presets.lighting.dusk
source: 黄昏
en: Dusk
ja: 夕暮れ

# remixPage.presets.lighting.neon
source: 霓虹
en: Neon
ja: ネオン

# remixPage.presets.lighting.night_exterior
source: 夜·外景
en: Night · exterior
ja: 夜・屋外

# remixPage.presets.lighting.night_interior
source: 夜·室内
en: Night · interior
ja: 夜・屋内

# remixPage.presets.lighting.overcast
source: 阴天
en: Overcast
ja: 曇り

# remixPage.presets.none
source: 不指定
en: Any
ja: 指定なし

# remixPage.presets.outfitHint
source: 填写后，这张设定图会作为该角色的独立造型保存，不会覆盖其他造型。
en: Saved as a separate outfit for this character — it won't replace other outfits.
ja: このキャラクターの別衣装として保存され、他の衣装を上書きしません。

# remixPage.presets.outfitLabel
source: 造型名称（可选）
en: Outfit name (optional)
ja: 衣装名（任意）

# remixPage.presets.outfitPlaceholder
source: 如：日常、婚礼、战甲
en: e.g. Casual, Wedding, Armor
ja: 例：普段着、ウェディング、鎧

# remixPage.presets.period.1980s
source: 八十年代
en: 1980s
ja: 1980年代

# remixPage.presets.period.1990s
source: 九十年代
en: 1990s
ja: 1990年代

# remixPage.presets.period.ancient
source: 古代
en: Ancient

# remixPage.presets.period.contemporary
source: 当代
en: Contemporary
ja: 現代

# remixPage.presets.period.near_future
source: 近未来
en: Near future

# remixPage.presets.period.republic
source: 民国
en: Republic era
ja: 民国期

# remixPage.presets.portraitHint
source: 定妆照是这个角色的身份锚点，定稿后所有造型的设定图都以它的脸为准。
en: The character's identity anchor — once approved, every look's sheet keeps this face.
ja: キャラクターの基準となる顔です。確定後、すべての衣装の設定画がこの顔に合わせられます。

# remixPage.presets.portraitLabel
source: 生成定妆照（正面头肩、中性表情）
en: Identity portrait (front, head and shoulders, neutral)
ja: メイク写真（正面・胸から上・無表情）

# remixPage.presets.sceneHint
source: 光照、天气、状态与时期会写入生成要求；已有主图时以主图为基准，保持结构与机位不变。
en: Lighting, weather, state and period are added to the brief; with a master image, structure and camera stay fixed.
ja: 光・天候・状態・時代が生成指示に加わります。メイン画像がある場合は構造とカメラを固定します。

# remixPage.presets.sceneSection
source: 场景变体
en: Scene variant
ja: シーンバリエーション

# remixPage.presets.state.damage_heavy
source: 战损·重
en: Damage · heavy
ja: 戦損・重

# remixPage.presets.state.damage_light
source: 战损·轻
en: Damage · light
ja: 戦損・軽

# remixPage.presets.state.damage_medium
source: 战损·中
en: Damage · medium
ja: 戦損・中

# remixPage.presets.state.festive
source: 节庆装饰
en: Festive
ja: 祝祭の飾り

# remixPage.presets.state.intact
source: 完好
en: Intact
ja: 無傷

# remixPage.presets.state.messy
source: 凌乱
en: Messy
ja: 散らかり

# remixPage.presets.state.ruins
source: 废墟
en: Ruins
ja: 廃墟

# remixPage.presets.state.searched
source: 被搜查
en: Ransacked
ja: 荒らされた

# remixPage.presets.weather.clear
source: 晴
en: Clear
ja: 晴れ

# remixPage.presets.weather.fog
source: 雾
en: Fog
ja: 霧

# remixPage.presets.weather.rain
source: 雨
en: Rain

# remixPage.presets.weather.sandstorm
source: 沙尘
en: Sandstorm
ja: 砂嵐

# remixPage.presets.weather.snow
source: 雪
en: Snow

# remixPage.promptLabel
source: 说说你想怎么改
en: What should change
ja: 変えたいこと

# remixPage.promptPlaceholder
source: 保留潮汐与环形遗迹，让天空转为暴雨将至的深蓝色；镜头缓慢向前推进，水面出现细微涟漪。
en: Keep the tide and the ring, turn the sky the deep blue before a storm, push the camera slowly forward, add fine ripples on the water.
ja: 潮汐と環状遺跡は残し、空を嵐の前の深い青に。カメラはゆっくり前進し、水面に細かな波紋を加える。

# remixPage.quality
source: 质量档位
en: Quality tier
ja: 品質

# remixPage.quoteFailed
source: 无法获取报价，请稍后重试。
en: Could not fetch a quote. Try again shortly.
ja: 見積もりを取得できませんでした。しばらくして再試行してください。

# remixPage.referenceCastEmpty
source: 还没有角色，先去角色库创建。
en: No characters yet — create one in the character library first.
ja: キャラクターがまだありません。先にキャラクターライブラリで作成してください。

# remixPage.referenceCastHint
source: 勾选角色作为生成时的参考图，最多 4 个。
en: Check up to 4 characters to use as generation references.
ja: 生成時の参照として、キャラクターを最大 4 件選択できます。

# remixPage.referenceCastLabel
source: 角色参考
en: Character references
ja: キャラクター参照

# remixPage.referenceEmotionLabel
source: 参考情绪（可选）
en: Reference emotion (optional)
ja: 参考の感情（任意）

# remixPage.referenceEmotionNone
source: 不指定
en: Not set
ja: 指定なし

# remixPage.referenceFramesGroup
source: 参考设置
en: Reference settings
ja: 参照設定

# remixPage.referenceLimitReached
source: 已达 4 个上限
en: 4-item limit reached
ja: 4件の上限に達しました

# remixPage.referenceMode
source: 参考方式
en: Reference mode
ja: 参照方式

# remixPage.referenceModeFrames
source: 首尾帧
en: First/last frames
ja: 開始・終了フレーム

# remixPage.referenceModeInputs
source: 图片/视频参考
en: Image/video references
ja: 画像・動画参照

# remixPage.referencePickLabel
source: 「{name}」使用哪些参考图
en: Which references to use for “{name}”
ja: 「{name}」で使う参考画像

# remixPage.referencePickLookDefault
source: 未勾选图片时，使用该造型的默认参考图。
en: With no image ticked, the look's default references are used.
ja: 画像を選ばない場合は、その衣装の既定の参考画像を使います。

# remixPage.referencePropsEmpty
source: 还没有道具，先去道具创作新建。
en: No props yet. Create one in Prop creation first.
ja: 小道具がまだありません。先に小道具の制作で追加してください。

# remixPage.referencePropsLabel
source: 道具参考
en: Prop references
ja: 小道具の参考

# remixPage.referenceScenesEmpty
source: 还没有场景，先去场景库创建。
en: No scenes yet — create one in the scene library first.
ja: シーンがまだありません。先にシーンライブラリで作成してください。

# remixPage.referenceScenesLabel
source: 场景参考
en: Scene references
ja: シーン参照

# remixPage.referenceViewBack
source: 背面
en: Back

# remixPage.referenceViewFront
source: 设定图
en: Sheet
ja: 設定画

# remixPage.referenceViewMaster
source: 主图
en: Master
ja: メイン

# remixPage.referenceViewOther
source: 参考图
en: Reference
ja: 参考画像

# remixPage.referenceViewSide
source: 侧面
en: Side
ja: 側面

# remixPage.resolution
source: 分辨率
en: Resolution
ja: 解像度

# remixPage.resolution2k
source: 2K超清
en: 2K
ja: 2K

# remixPage.resolutionAdapted
source: 将按{actual}生成
en: Will generate at {actual}
ja: {actual} で生成します

# remixPage.resolutionFhd
source: 超清 1080p
en: Full HD 1080p
ja: フルHD 1080p

# remixPage.resolutionHd
source: 高清 720p
en: HD 720p
ja: HD 720p

# remixPage.resolutionHint
source: 更高分辨率画质更好，生成耗时也更长。
en: Higher resolution looks better but takes longer to generate.
ja: 解像度が高いほど画質は良くなりますが、生成に時間がかかります。

# remixPage.resolutionHintAuto
source: 实际分辨率以所选模型能达到的最高不超过此档为准。
en: The actual resolution will be the highest the chosen model supports that does not exceed this tier.
ja: 実際の解像度は、選択したモデルがこの上限以内で出せる最高の解像度です。

# remixPage.resolutionSd
source: 标清 480p
en: SD 480p
ja: SD 480p

# remixPage.returnBannerAbandon
source: 放弃并直接返回
en: Discard and go back now
ja: 破棄してすぐに戻る

# remixPage.returnBannerCharacter
source: 正在为《{name}》生成角色图，完成后可一键关联回文案创作
en: Generating a character image for "{name}" — link it back to the script once it's done.
ja: 「{name}」のキャラクター画像を生成中です。完了後に脚本作成へ関連付けて戻れます。

# remixPage.returnBannerScene
source: 正在为《{name}》生成场景图，完成后可一键关联回文案创作
en: Generating a scene image for "{name}" — link it back to the script once it's done.
ja: 「{name}」のシーン画像を生成中です。完了後に脚本作成へ関連付けて戻れます。

# remixPage.returnToCharacters
source: 返回角色库
en: Back to characters
ja: キャラクターに戻る

# remixPage.returnToScenes
source: 返回场景库
en: Back to scenes
ja: シーンライブラリに戻る

# remixPage.returnToScript
source: 返回文案创作
en: Back to script
ja: 脚本作成に戻る

# remixPage.rightsConfirm
source: 我确认拥有新增素材的使用权，并保留原作者著名。
en: I own the rights to any asset I added, and I keep the original credit.
ja: 追加した素材の権利を保有し、原作者のクレジットを保持します。

# remixPage.seed
source: 随机种子
en: Seed
ja: シード

# remixPage.seedHint
source: 可选；填写相同整数便于复现相近结果。
en: Optional; reuse an integer for similar results.
ja: 任意。同じ整数で近い結果を再現できます。

# remixPage.seedInvalid
source: 请输入 0 到 2147483647 之间的整数。
en: Enter an integer from 0 to 2147483647.
ja: 0から2147483647までの整数を入力してください。

# remixPage.selectUploadedImage
source: 选择已上传图片
en: Select an uploaded image
ja: アップロード済み画像を選択

# remixPage.skillPreset
source: 创作技能
en: Creation skill
ja: 創作スキル

# remixPage.skillPresetHint
source: 应用你收藏的场景、镜头等技能参数。
en: Apply a saved scene, lens, or other skill's parameters.
ja: 保存したシーンやレンズなどのスキルパラメータを適用します。

# remixPage.skillPresetNone
source: 不使用
en: None
ja: 使用しない

# remixPage.sound
source: 生成声音
en: Sound
ja: 音声

# remixPage.soundAmbient
source: 生成环境音
en: Ambient
ja: 環境音を生成

# remixPage.soundOff
source: 不生成
en: None
ja: 生成しない

# remixPage.sourceHint
source: 由原作者允许复用
en: Reuse permitted by the author
ja: 作者が再利用を許可

# remixPage.sourceMaterials
source: 来源素材 {count}
en: Source assets {count}
ja: 素材 {count} 件

# remixPage.sourceVideo
source: 源视频
en: Source video
ja: 元の動画

# remixPage.stylePreset
source: 风格预设
en: Style preset
ja: スタイルプリセット

# remixPage.stylePresetHint
source: 应用你或社区保存的参数，之后仍可继续调整。
en: Apply saved parameters from you or the community, then keep editing.
ja: あなたやコミュニティが保存したパラメータを適用してから、さらに調整できます。

# remixPage.stylePresetNone
source: 不使用
en: None
ja: 使用しない

# remixPage.styleReference
source: 风格参考
en: Style reference
ja: スタイル参照

# remixPage.submit
source: 生成我的版本
en: Generate my version
ja: この版を生成

# remixPage.submitGenerating
source: 正在生成
en: Generating
ja: 生成中

# remixPage.submitPolishing
source: 润色中…
en: Polishing…
ja: 校正中…

# remixPage.submitting
source: 正在提交
en: Submitting
ja: 送信中

# remixPage.subtitle
source: 灵感和允许复用的信息已带入，你只需说出想改变的部分。
en: The inspiration and everything you may reuse is already carried over. Just say what should change.
ja: インスピレーションと再利用が許可された情報は取り込み済みです。変えたい部分だけ伝えてください。

# remixPage.targetCharacter
source: 目标角色
en: Target character
ja: 対象キャラクター

# remixPage.targetCharacterAutoCreate
source: 自动创建新角色
en: Create a new character automatically
ja: 新しいキャラクターを自動作成

# remixPage.targetCharacterHint
source: 留空将在生成完成后自动创建一个新角色。
en: Leave blank to create a new character automatically once this finishes.
ja: 空欄のままにすると、生成完了後に新しいキャラクターが自動作成されます。

# remixPage.tierCinematic
source: 电影级
en: Cinematic
ja: シネマ級

# remixPage.tierCinematicDesc
source: 精细光影与运动
en: Fine light and motion
ja: 繊細な光と動き

# remixPage.tierPreview
source: 快速预览
en: Quick preview
ja: クイックプレビュー

# remixPage.tierPreviewDesc
source: 验证构图与动作
en: Check composition and motion
ja: 構図と動きの確認

# remixPage.tierStandard
source: 标准
en: Standard
ja: 標準

# remixPage.tierStandardDesc
source: 适合日常发布
en: Good for everyday publishing
ja: 日常の公開向け

# remixPage.titleFrom
source: 从《{title}》开始新版本
en: A new version of “{title}”
ja: 『{title}』から新しい版をつくる

# remixPage.unlockCta
source: 积分解锁
en: Unlock with credits
ja: クレジットで解除

# remixPage.uploadedImage
source: 已上传图片 {index}
en: Uploaded image {index}
ja: アップロード画像 {index}

# remixPage.useVideoAsReference
source: 基于此视频继续创作
en: Continue from this video
ja: この動画を元に続けて創作する

# remixPage.videoAssetKind
source: 创作类型
en: Creation type
ja: 創作タイプ

# remixPage.videoAssetKindCharacterAction
source: 角色动作视频
en: Character action video
ja: キャラクター動作動画

# remixPage.videoAssetKindCover
source: 预告/封面视频
en: Trailer/cover video
ja: 予告編/カバー動画

# remixPage.videoAssetKindGeneral
source: 自由创作
en: Freeform
ja: 自由創作

# remixPage.videoAssetKindHint
source: 选择这段视频的用途，将决定使用的生成流程与提示词规划。
en: What this video is for decides the generation flow and prompt planning used.
ja: この動画の用途を選ぶと、使用する生成フローとプロンプト設計が決まります。

# remixPage.videoAssetKindScene
source: 场景视频
en: Scene video
ja: シーン動画

# remixPage.videoAssetKindTransition
source: 转场片段
en: Transition clip
ja: トランジション素材

# remixPage.videoReference
source: 视频参考
en: Video reference
ja: 動画参照

# remixPage.viewSourceWork
source: 查看原作
en: View the original
ja: 原作を見る

# remixPage.voice
source: 音色
en: Voice
ja: 音声

# remixPage.voiceHint
source: 选择生成语音使用的音色。
en: Pick the voice used to generate the audio.
ja: 生成する音声の声質を選びます。

# scenes.backToLibrary
source: 返回场景库
en: Back to scenes
ja: シーン一覧へ戻る

# scenes.clipsLabel
source: 关联视频
en: Linked videos
ja: 関連動画

# scenes.deleteConfirmBody
source: 删除「{name}」后无法恢复，参考素材都会一并移除。
en: Deleting "{name}" cannot be undone — its reference assets will be removed too.
ja: 「{name}」を削除すると元に戻せません。参考素材も削除されます。

# scenes.deleteConfirmTitle
source: 删除这个场景？
en: Delete this scene?
ja: このシーンを削除しますか？

# scenes.descriptionLabel
source: 场景描述
en: Description
ja: 説明

# scenes.editScene
source: 编辑场景
en: Edit scene
ja: シーンを編集

# scenes.emptyHint
source: 新建一个场景，再生成一张主图，方便多集短剧复用。
en: Create a scene, then generate an establishing image you can reuse across episodes.
ja: シーンを追加してメイン画像を生成すると、複数話で使い回せます。

# scenes.emptyTitle
source: 还没有场景
en: No scenes yet
ja: まだシーンがいません

# scenes.extraRefsLabel
source: 其他参考
en: Other references
ja: その他の参考

# scenes.eyebrow
source: 场景库
en: Scene library
ja: シーンライブラリ

# scenes.generateAgain
source: 再生成场景图
en: Generate again
ja: シーン画像を再生成

# scenes.generateSceneVideo
source: 生成场景视频 →
en: Generate scene video →
ja: シーン動画を生成 →

# scenes.generateSheet
source: 生成场景图
en: Generate scene image
ja: シーン画像を生成

# scenes.manageEyebrow
source: 场景管理
en: Scene
ja: シーン管理

# scenes.manageVariants
source: 管理变体
en: Manage variants
ja: バリエーションを管理

# scenes.nameLabel
source: 场景名称
en: Name
ja: シーン名

# scenes.newScene
source: 新建场景
en: New scene
ja: シーンを追加

# scenes.noReference
source: 暂无参考素材
en: No reference yet
ja: 参考素材はまだありません

# scenes.priceHint
source: 0 为免费。分享后其他人可在技能广场发现并使用，付费需先用积分解锁。
en: 0 is free. Once shared, others can discover and use it from the skill marketplace (paid unlocks spend credits).
ja: 0 は無料です。共有するとスキルマーケットで他の人が発見・利用できます（有料はクレジットで解除）。

# scenes.priceLabel
source: 解锁价格
en: Unlock price
ja: 解除価格

# scenes.publishScene
source: 分享场景
en: Share scene
ja: シーンを共有

# scenes.publishSceneHint
source: 分享后该场景会提交审核，通过后其他创作者可以在技能广场看到并使用（如设置了积分价格，还可以购买解锁）。
en: Sharing submits this scene for review. Once approved, other creators can find and use it in the skill marketplace (and unlock it with credits if you set a price).
ja: 共有すると審査に送られます。承認後、他のクリエイターがスキルマーケットで見つけて使えます（価格を設定した場合はクレジットで解除）。

# scenes.referenceChooseExisting
source: 选择已有
en: Choose existing
ja: 既存を選ぶ

# scenes.referenceHint
source: 最多 4 个，将用于后续生成时保持场景样貌一致。
en: Up to 4, used to keep this scene's look consistent in future generations.
ja: 最大4個まで。今後の生成でこのシーンの見た目を保つために使われます。

# scenes.referenceLabel
source: 参考图或视频
en: Reference images or videos
ja: 参考画像または動画

# scenes.referencePickerEmpty
source: 暂无可选择的图片
en: No images to choose yet
ja: 選べる画像はまだありません

# scenes.referencePickerError
source: 加载失败，请重试
en: Couldn't load images. Try again.
ja: 読み込みに失敗しました。再試行してください

# scenes.referencePickerTitle
source: 选择已生成的图片
en: Choose a generated image
ja: 生成済みの画像を選ぶ

# scenes.referenceUpload
source: 上传
en: Upload
ja: アップロード

# scenes.saveAndGenerate
source: 保存并生成
en: Save and generate
ja: 保存して生成

# scenes.sheetHint
source: 一张建立镜头，固定空间结构与光色。也可上传或选择已有图片。
en: One establishing shot that locks the space, light, and colour. You can also upload or pick an existing image.
ja: 空間の構造と光、色を固定する1枚の設定ショットです。アップロードや既存画像の選択もできます。

# scenes.sheetLabel
source: 场景主图
en: Establishing image
ja: シーンのメイン画像

# scenes.subtitle
source: 保存场景主图，短剧多集之间保持一致。
en: Save a scene's establishing image so a multi-episode short stays consistent.
ja: シーンのメイン画像を保存し、複数話をまたいで一貫性を保ちます。

# scenes.title
source: 场景
en: Scenes
ja: シーン

# settingsPage.avatar
source: 头像
en: Avatar
ja: アバター

# settingsPage.backToProfile
source: 返回个人中心
en: Back to profile
ja: プロフィールに戻る

# settingsPage.bio
source: 个人简介
en: Bio
ja: 自己紹介

# settingsPage.changeAvatar
source: 更换头像
en: Change avatar
ja: アバターを変更

# settingsPage.dataSection
source: 数据与账号
en: Data & account
ja: データとアカウント

# settingsPage.deleteAccount
source: 删除账号
en: Delete account
ja: アカウントを削除

# settingsPage.deleteAccountDesc
source: 创作链中的位置会保留为墓碑节点
en: Your place in the lineage is kept as a tombstone
ja: 創作チェーン上の位置は墓標として残ります

# settingsPage.deleteConfirmBody
source: 账号资料会被匿名化，你在创作链中的位置会保留为墓碑节点。这个操作无法撤销。
en: Your profile is anonymised and your place in the lineage stays as a tombstone. This cannot be undone.
ja: プロフィールは匿名化され、創作チェーン上の位置は墓標として残ります。取り消せません。

# settingsPage.deleteConfirmTitle
source: 确认删除账号
en: Confirm account deletion
ja: アカウント削除の確認

# settingsPage.deleteRequested
source: 删除请求已提交，需要管理员审核。
en: Deletion requested. An administrator has to review it.
ja: 削除を申請しました。管理者の確認が必要です。

# settingsPage.displayName
source: 显示名称
en: Display name
ja: 表示名

# settingsPage.displaySection
source: 显示
en: Display
ja: 表示

# settingsPage.exportData
source: 导出我的数据
en: Export my data
ja: データをエクスポート

# settingsPage.exportDataDesc
source: 包含资料、作品清单与积分账本
en: Profile, work list and credit ledger
ja: プロフィール・作品一覧・クレジット台帳

# settingsPage.exportRequested
source: 导出请求已提交，处理完成后会通知你。
en: Export requested. We will notify you when it is ready.
ja: エクスポートを申請しました。完了したらお知らせします。

# settingsPage.location
source: 所在地
en: Location

# settingsPage.navDisplay
source: 显示与无障碍
en: Display & accessibility
ja: 表示とアクセシビリティ

# settingsPage.navNotifications
source: 通知偏好
en: Notifications
ja: 通知設定

# settingsPage.navPlatforms
source: 发布平台
en: Platforms
ja: プラットフォーム連携

# settingsPage.navPrivacy
source: 隐私与安全
en: Privacy & security
ja: プライバシーとセキュリティ

# settingsPage.navProfile
source: 个人资料
en: Profile
ja: プロフィール

# settingsPage.notificationsSection
source: 通知
en: Notifications

# settingsPage.privacySection
source: 隐私与偏好
en: Privacy & preferences
ja: プライバシーと環境設定

# settingsPage.profileSection
source: 个人资料
en: Profile
ja: プロフィール

# settingsPage.publicProfile
source: 公开个人主页
en: Public profile page
ja: 公開プロフィールページ

# settingsPage.publicProfileDesc
source: 允许其他用户查看你的公开作品和创作资料
en: Let others see your public works and creator profile
ja: 公開作品とクリエイター情報を他のユーザーに見せる

# settingsPage.pushEnable
source: 开启推送通知
en: Enable push notifications
ja: プッシュ通知を有効にする

# settingsPage.pushEnableDesc
source: 接收任务进度、二创与新粉丝的提醒
en: Get notified about job progress, remixes and followers
ja: タスクの進捗、リミックス、フォロワーの通知を受け取れます

# settingsPage.pushOpenSystemSettings
source: 通知已关闭 — 前往系统设置开启
en: Notifications are off — open system settings
ja: 通知がオフです — システム設定を開く

# settingsPage.reasonLabel
source: 说明原因
en: Tell us why
ja: 理由を記入

# settingsPage.reduceMotion
source: 减少动态效果
en: Reduce motion
ja: 動きを減らす

# settingsPage.reduceMotionDesc
source: 减少轮播、抽屉和状态动画
en: Tone down carousels, drawers and status animation
ja: カルーセル・ドロワー・状態アニメーションを抑える

# settingsPage.regionDesc
source: 决定价格展示的货币与界面语言
en: Sets the currency prices are shown in, and the interface language
ja: 価格表示の通貨と表示言語を決めます

# settingsPage.regionLabel
source: 地区与货币
en: Region and currency
ja: 地域と通貨

# settingsPage.remixNotify
source: 二创与引用通知
en: Remix and citation alerts
ja: 二次創作・引用の通知

# settingsPage.remixNotifyDesc
source: 有人基于你的公开作品创作时通知你
en: Tell me when someone builds on my public work
ja: 自分の公開作品をもとに制作されたら知らせる

# settingsPage.saveFailed
source: 保存失败，请检查后重试。
en: Could not save. Check the form and try again.
ja: 保存できませんでした。内容を確認して再試行してください。

# settingsPage.saved
source: 设置已保存
en: Settings saved
ja: 設定を保存しました

# settingsPage.subtitle
source: 管理公开资料、隐私、安全、通知和无障碍偏好。
en: Manage your public profile, privacy, security, notifications and accessibility.
ja: 公開プロフィール・プライバシー・セキュリティ・通知・アクセシビリティを管理します。

# settingsPage.themeDesc
source: 深色是设计基准，浅色已逐项通过对比度检查
en: Dark is the design baseline; light has been checked for contrast
ja: ダークが設計基準です。ライトはコントラストを個別に確認済みです
